Revit 2024 API
BuiltInFailures.SketchFailures.SketchedShapeNotAvailable Property
 Skeched shape is not available for this type of element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchedShapeNotAvailable { get; }
Visual Basic
Public Shared ReadOnly Property SketchedShapeNotAvailable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchedShapeNotAvailable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace